export const SIGNUP_SECTION_NAME = [
    {
        title: "first",
    },
    { title: "second" },
] as const;

export const SIGNUP_DATA={
    email: "",
    name: "",
    password: "",
    stdId: "0000",
    room: "000",
    phoneNum: "000-0000-0000",
    gender: "FEMALE",
}

export const TERMS_OF_SERVICE = `
    Qvick 이용약관
    
    제1조 목적
    Team C0nnect(이하 운영진)는 이용자(이하 유저)에게 기숙사 온라인 출석체크 서비스 "Qvick" (이하 서비스)를 이용하기 위한 약관과 그 정의를 서술하고 있습니다.
    
    제2조 이용 조건
    유저는 대구소프트웨어마이스터고등학교(이하 학교)에 재학 중이며, 기숙사 시설을 이용 중이거나 이용 예정인 자여야 합니다. 또한 운영진은 아래의 사항에 해당하지 않는 자에게 합당한 사유가 없는 한 서비스 이용을 수락, 제공해야 합니다.
    1. 유저가 학교 재학생이 아닌 경우, 이는 자퇴 / 퇴학 등 현재 학교 서류 상으로 재학 중이지 않은 경우를 모두 포괄한다.
    2. 유저가 현재 학교에 기숙사 시설을 이용 중이지 않을 경우, 시설 이용자라 함은 기숙사에 숙박하며 이용하는 것을 말한다.
    3. 유저 정보를 허위/과장하여 작성하거나 타인의 개인정보를 도용하였을 경우. 이미 이용 중인 유저더라도 허위/과장된 정보 또는 도용 사실이 밝혀질 경우 즉시 회원 탈퇴 조치된다.
    
    제3조 약관 효력 및 권리
    유저가 회원가입 시 약관 동의 후 즉시 효력이 생기며, 유저는 해당 약관 동의를 거부할 수 있습니다. 그러나 동의하지 않을 경우 서비스 이용이 불가능함을 알립니다. 운영진은 약관의 내용을 관련 법령이 제정하는 범위에 한하여 변경할 수 있으며 이를 유저에게 공지하여야 합니다. 유저는 관련 내용을 확인 후 언제든 동의를 해지할 수 있으며, 이에 따라 서비스 이용은 즉각 중지됩니다.
    
    제4조 회원가입 또는 이용신청
    유저는 회원가입(또는 이용신청이라 칭함)할 시에 아래 각 호에서 정의한 정보를 입력 후, 개인정보처리방침/이용약관에 동의하여야 가입(신청)을 정상적으로 완료할 수 있습니다.
`;

export const PRIVACY_POLICY = `
    개인정보처리방침
    
    제1조 목적
    Team C0nnect(이하 운영진)는 대구소프트웨어마이스터고등학교(이하 학교)의 기숙사 관리 온라인 플랫폼 Qvick(이하 서비스) 이용을 위해 개인정보를 수집 및 관리하고 있습니다.
    
    제2조 수집과 이용목적
    운영진은 다음과 같은 개인정보를 유저에게서 수집합니다.
    - 전자메일(e-mail)
    - 유저의 주민등록등본 상의 실명
    - 유저가 등록한 비밀번호
    - 유저의 현재 학번과 호실
    - 유저의 기숙사 출석 여부
    
    유저는 해당 정보를 제공함에 있어 허위/과장/도용 된 정보가 없어야 하며, 발각 시에는 즉각 서비스 이용 중지 및 추후 학교에서 정하는 교칙과 관련 대한민국 법령에 의거하여 처리합니다.
    
    수집된 정보는 다음과 같은 목적을 위해 사용되며 기타 목적으로는 사용되지 않습니다. 사용 목적에 변경사항이 발생할 경우 유저에게 공지합니다.
`;